# St7GetNumLoadPathTemplateHeatSources

Returns the number of heat sources assigned to the specified load path template.

long St7GetNumLoadPathTemplateHeatSources(long uID, long TemplateID,

long Vehicle, long* NumHeatSources)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Vehicle

Vehicle number.

Output Parameters

NumHeatSources

Number of heat sources.

Strand7 API Manual